
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//IPАдресКлиента	////ВремяЗавершенияСпящегоСеанса	////ВремяЗасыпанияПассивногоСеанса	//ВремяНачала	//ВремяПоследнейАктивности	////ДлительностьВызововВсего	////ДлительностьВызововЗа5Мин	////ДлительностьВызововСервисаТекущее	////ДлительностьВызововСервисовВсего	////ДлительностьВызововСервисовЗа5Мин	////ДлительностьВызововСУБДВсего	////ДлительностьВызововСУБДЗа5Мин	////ДлительностьВызововСУБДТекущее	////ДлительностьВызововТекущее	//ИдентификаторИнформационнойБазы	//ИдентификаторПроцесса	//ИдентификаторСеанса	//ИдентификаторСоединения	//ИмяКомпьютера	//ИмяПользователя	//ИмяПриложения	//ИмяТекущегоСервиса	////КодЯзыка	////КоличествоВызововВсего	////КоличествоВызововЗа5Мин	//Лицензии	////НомерСеанса	////НомерСеансаБлокирующегоСУБД	////НомерСеансаВыполнившегоУправляемуюБлокировку	////ОбъемДанныхЗаписанныхНаДискВсего	////ОбъемДанныхЗаписанныхНаДискЗа5Мин	////ОбъемДанныхЗаписанныхНаДискТекущее	////ОбъемДанныхПереданныхИПолученныхКлиентом	////ОбъемДанныхПереданныхИПолученныхКлиентомЗа5Мин	////ОбъемДанныхПереданныхИПолученныхСУБДВсего	////ОбъемДанныхПереданныхИПолученныхСУБДЗа5Мин	////ОбъемДанныхСчитанныхСДискаВсего	////ОбъемДанныхСчитанныхСДискаЗа5Минут	////ОбъемДанныхСчитанныхСДискаТекущее	////ПотреблениеПамятиВсего	////ПотреблениеПамятиЗа5Мин	////ПотреблениеПамятиТекущее	////ПроцессорноеВремяВсего	////ПроцессорноеВремяЗа5Мин	////ПроцессорноеВремяТекущее	////РазделениеДанных	//СоединениеСУБД	//СпящийСеанс  
	
	УстановитьТаблицуПользователей();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьТаблицуПользователей()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ПользователиИнформационныхБаз.ПользовательИБ.Наименование КАК ИмяПользователя,
				|	ПользователиИнформационныхБаз.ПользовательИБ КАК ПользовательИБ
				|ПОМЕСТИТЬ ВТ_ПользователиИБ
				|ИЗ
				|	РегистрСведений.ПользователиИнформационныхБаз КАК ПользователиИнформационныхБаз
				|ГДЕ
				|	ПользователиИнформационныхБаз.ИнформационнаяБаза = &ИнформационнаяБаза
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИмяПользователя
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаСеансов.IPАдресКлиента КАК IPАдресКлиента,
				|	ТаблицаСеансов.ВремяНачала КАК ВремяНачала,
				|	ТаблицаСеансов.ВремяПоследнейАктивности КАК ВремяПоследнейАктивности,
				|	ТаблицаСеансов.ИдентификаторИнформационнойБазы КАК ИдентификаторИнформационнойБазы,
				|	ТаблицаСеансов.ИдентификаторПроцесса КАК ИдентификаторПроцесса,
				|	ТаблицаСеансов.ИдентификаторСеанса КАК ИдентификаторСеанса,
				|	ТаблицаСеансов.ИдентификаторСоединения КАК ИдентификаторСоединения,
				|	ТаблицаСеансов.ИмяКомпьютера КАК ИмяКомпьютера,
				|	ТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
				|	ТаблицаСеансов.ИмяПриложения КАК ИмяПриложения,
				|	ТаблицаСеансов.ИмяТекущегоСервиса КАК ИмяТекущегоСервиса,
				|	ТаблицаСеансов.Лицензии КАК Лицензии,
				|	ТаблицаСеансов.СоединениеСУБД КАК СоединениеСУБД,
				|	ТаблицаСеансов.СпящийСеанс КАК СпящийСеанс
				|ПОМЕСТИТЬ ВТ_СеансыПользователей
				|ИЗ
				|	&ТаблицаСеансов КАК ТаблицаСеансов
				|ГДЕ
				|	ТаблицаСеансов.ИмяПриложения <> ""RAS""
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИмяПользователя
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЕСТЬNULL(ВТ_ПользователиИБ.ИмяПользователя, ВТ_СеансыПользователей.ИмяПользователя) КАК ИмяПользователя,
				|	ВТ_СеансыПользователей.IPАдресКлиента КАК IPАдресКлиента,
				|	ВТ_СеансыПользователей.ВремяНачала КАК ВремяНачала,
				|	ВТ_СеансыПользователей.ВремяПоследнейАктивности КАК ВремяПоследнейАктивности,
				|	ВТ_СеансыПользователей.ИдентификаторИнформационнойБазы КАК ИдентификаторИнформационнойБазы,
				|	ВТ_СеансыПользователей.ИдентификаторПроцесса КАК ИдентификаторПроцесса,
				|	ВТ_СеансыПользователей.ИдентификаторСеанса КАК ИдентификаторСеанса,
				|	ВТ_СеансыПользователей.ИдентификаторСоединения КАК ИдентификаторСоединения,
				|	ВТ_СеансыПользователей.ИмяКомпьютера КАК ИмяКомпьютера,
				|	ВТ_СеансыПользователей.ИмяПриложения КАК ИмяПриложения,
				|	ВТ_СеансыПользователей.ИмяТекущегоСервиса КАК ИмяТекущегоСервиса,
				|	ВТ_СеансыПользователей.Лицензии КАК Лицензии,
				|	ВТ_СеансыПользователей.СоединениеСУБД КАК СоединениеСУБД,
				|	ВТ_СеансыПользователей.СпящийСеанс КАК СпящийСеанс,
				|	ВЫБОР
				|		КОГДА ВТ_СеансыПользователей.ВремяНачала ЕСТЬ NULL
				|			ТОГДА 1
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ПолеУпорядочивания
				|ИЗ
				|	ВТ_ПользователиИБ КАК ВТ_ПользователиИБ
				|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СеансыПользователей КАК ВТ_СеансыПользователей
				|		ПО ВТ_ПользователиИБ.ИмяПользователя = ВТ_СеансыПользователей.ИмяПользователя
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПолеУпорядочивания,
				|	ВремяНачала";
	
	ТаблицаСеансов = АдминистрированиеИнформационныхБаз.ПолучитьТаблицуСеансовИнформационнойБазы(Объект.Ссылка);
	
	Запрос.УстановитьПараметр("ТаблицаСеансов", ТаблицаСеансов);
	Запрос.УстановитьПараметр("ИнформационнаяБаза", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТаблицаПользователей.Загрузить(Результат.Выгрузить());	

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСоединенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ф = ВыбраннаяСтрока; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСеанс(Команда)
	
	МассивИдентификаторовСеансов = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.ТаблицаПользователей.ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = ТаблицаПользователей.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(ВыделеннаяСтрока.ИдентификаторСеанса) Тогда
			МассивИдентификаторовСеансов.Добавить(ВыделеннаяСтрока.ИдентификаторСеанса);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИдентификаторовСеансов.Количество() > 0 Тогда
		ЗавершитьСеансНаСервере(МассивИдентификаторовСеансов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСеансНаСервере(МассивИдентификаторовСеансов)
	
	АдминистрированиеИнформационныхБаз.ЗавершитьСеансыИнформационнойБазы(Объект.Ссылка, МассивИдентификаторовСеансов);
	УстановитьТаблицуПользователей();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	УстановитьТаблицуПользователей();
	
КонецПроцедуры


&НаСервере
Процедура ЗавершитьВсеСеансыНаСервере()

	АдминистрированиеИнформационныхБаз.ЗавершитьСеансыИнформационнойБазы(Объект.Ссылка);
	УстановитьТаблицуПользователей();

КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьВсеСеансы(Команда)  
	
	ЗавершитьВсеСеансыНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗавершитьСпящиеСеансыНаСервере()

	АдминистрированиеИнформационныхБаз.ЗавершитьСеансыИнформационнойБазы(Объект.Ссылка, , Истина);
	УстановитьТаблицуПользователей();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьСпящиеСеансы(Команда)
	ЗавершитьСпящиеСеансыНаСервере();
КонецПроцедуры

