
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Телефон" Или Поле.Имя = "Почта" Тогда
		
		СтандартнаяОбработка = Ложь;
		ЗначениеДляБуфера = Элемент.ТекущиеДанные[Поле.Имя];
		РаботаСБуферомОбменаКлиентСервер.СкопироватьВБуферОбмена(ЗначениеДляБуфера, ЭтотОбъект["ПолеHTMLБуфера"]);
		
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСБуферомОбменаКлиентСервер.ДобавитьЭлементыФормыДляHTMLБуфера(ЭтотОбъект, Элементы);
	
КонецПроцедуры

