 
 
Функция ПолучитьОписаниеСтруктурыПараметров() Экспорт
	
	СтруктураПараметров = Новый Структура("ПользовательЦентральногоСервер,
									|ПарольЦентральногоСервера, 
									|ПользовательСУБД,
									|ПарольСУБД,
									|ИмяАдминистратораКластера,
									|ПарольАдминистратораКластера,
									|ПользовательИБ,
									|ПарольИБ");
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьСтруктуруНастроекПоУмолчанию() Экспорт
	
	СохраненнаяСтрукутара = Константы.ОбщиеПараметрыАутентификации.Получить().Получить();
	СтруктураПараметров = ПолучитьОписаниеСтруктурыПараметров();

	Если ЗначениеЗаполнено(СохраненнаяСтрукутара) Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, СохраненнаяСтрукутара);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции  

Процедура ЗаписатьСтруктуруНастроекПоУмолчанию(СтруктураПараметров) Экспорт

	Константы.ОбщиеПараметрыАутентификации.Установить(Новый ХранилищеЗначения(СтруктураПараметров));

КонецПроцедуры      


