
 
Процедура СобратьСтатистикуИспользованияИнформационныхБаз() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	Кластеры1С.Ссылка КАК Кластер
				|ИЗ
				|	Справочник.Кластеры1С КАК Кластеры1С
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЗаданияОбъектов КАК ТекущиеЗаданияОбъектов
				|		ПО (ТекущиеЗаданияОбъектов.Объект = Кластеры1С.Ссылка)
				|ГДЕ
				|	ТекущиеЗаданияОбъектов.Объект ЕСТЬ NULL
				|	И Кластеры1С.Активен";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТаблицаСеансов = АдминистрированиеСерверов.ПолучитьТаблицуАктивныхСеансовКластера(Выборка.Кластер);
		ЗаписатьТаблицуВРегистр(ТаблицаСеансов);
	КонецЦикла;                                                                  
	
КонецПроцедуры    

Процедура ЗаписатьТаблицуВРегистр(ТаблицаСеансов)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСеансов.ИдентификаторИнформационнойБазы КАК ИдентификаторИнформационнойБазы,
	               |	ТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
	               |	ТаблицаСеансов.ВремяНачала КАК ВремяНачала
	               |ПОМЕСТИТЬ ВТ_Сеансы
	               |ИЗ
	               |	&ТаблицаСеансов КАК ТаблицаСеансов
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ИдентификаторИнформационнойБазы,
	               |	ИмяПользователя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза,
	               |	ПользователиИБ.Ссылка КАК ПользовательИБ,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Сеансы.ВремяНачала) КАК КоличествоСеансов,
	               |	&ТекущаяДата КАК Период
	               |ИЗ
	               |	ВТ_Сеансы КАК ВТ_Сеансы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПользователиИБ КАК ПользователиИБ
	               |		ПО ВТ_Сеансы.ИмяПользователя = ПользователиИБ.ИмяПользователя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |		ПО ВТ_Сеансы.ИдентификаторИнформационнойБазы = ИнформационныеБазы.ИдентификаторБазы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИнформационныеБазы.Ссылка,
	               |	ПользователиИБ.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаСеансов",	ТаблицаСеансов);
	Запрос.УстановитьПараметр("ТекущаяДата",	ТекущаяДата);
	
	Результат = Запрос.Выполнить();
	НаборЗаписейСтатистики = РегистрыСведений.СтатистикаИспользованияИнформационныхБаз.СоздатьНаборЗаписей();
	//НаборЗаписейСтатистики.Отбор.Период.Установить(ТекущаяДата);
	НаборЗаписейСтатистики.Загрузить(Результат.Выгрузить());
	
	НаборЗаписейСтатистики.Записать();

КонецПроцедуры



 
 