 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		
		ТекущаяСтраницаПараметров = "ГруппаИнформация";
		
	КонецЕсли;    
	
	//СводнаяИнформация = Справочники.ИнформационныеБазы.ПолучитьМакет("МакетПоказателей");
	
	//Отладка
	УстановитьОтображениеНезаполненныхЭлементов();	
	
	ЖурналРегистрации = "ClickHouse";
	
	ОбъемБазы = "4.7 Гб (из 11 Гб)";
	КоличествоАктивныхСеансов = 18;
	Объект.ИспользуетсяПо = ТекущаяДата();
	
	ОтобразитьГрафикАктивности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры   
 
&НаСервере
Процедура УстановитьОтображениеНезаполненныхЭлементов()
	
	ОформлениеСсылки = Новый Структура("Шрифт, ЦветТекста", Новый Шрифт(, 11, , , Истина), ЦветаСтиля.ГиперссылкаЦвет);
	ОформлениеПустойСсылки = Новый Структура("Шрифт, ЦветТекста", Новый Шрифт(, 11, , , Истина), ЦветаСтиля.ЦветПустойГиперссылки);
	
	СписокПроверяемыхРеквизитов = Новый Соответствие;
	СписокПроверяемыхРеквизитов.Вставить("Конфигурация", "ВерсияКонфигурации");
	СписокПроверяемыхРеквизитов.Вставить("ДатаСоздания", "ДатаСоздания");
	СписокПроверяемыхРеквизитов.Вставить("ИспользуетсяПо", "ИспользуетсяПо");
	СписокПроверяемыхРеквизитов.Вставить("НазначениеИБ", "Назначение");
	СписокПроверяемыхРеквизитов.Вставить("Ответственный", "Ответственный");
	СписокПроверяемыхРеквизитов.Вставить("Проект", "Проект");
	СписокПроверяемыхРеквизитов.Вставить("ВебСервер", "ВебСервер");
	СписокПроверяемыхРеквизитов.Вставить("ХранилищеКонфигурации", "ХранилищеКонфигурации");

	Если ЗначениеЗаполнено(Объект.ВерсияКонфигурации) Тогда
		ЭтотОбъект.Конфигурация = Новый ФорматированнаяСтрока(Строка(Объект.ВерсияКонфигурации));
	Иначе                                                                             
		ЭтотОбъект.Конфигурация = Новый ФорматированнаяСтрока(БиблиотекаКартинок.Предупреждение, " <Не заполнено>");
	КонецЕсли;

КонецПроцедуры // УстановитьОтображениеНезаполненныхЭлементов()

&НаКлиенте
Процедура КонфигурацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ВерсияКонфигурации) Тогда
		
		ОткрытьФорму("Справочник.ВерсииКонфигураций.ФормаОбъекта", 
					Новый Структура("Ключ", Объект.ВерсияКонфигурации), 
					Элемент, ЭтаФорма, 
					, , , 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе                                                                                                                 
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяЭлемента", "Конфигурация");
		СтруктураПараметров.Вставить("ИмяРеквизита", "ВерсияКонфигурации");
		ОписаниеОпопвещенияВыбора = Новый ОписаниеОповещения("ОбработкаВыбораЗначенияРеквизита", ЭтотОбъект, СтруктураПараметров);
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
		
		ОткрытьФорму("Справочник.ВерсииКонфигураций.ФормаВыбора", 
					ПараметрыФормыВыбора, 
					Элемент, ЭтаФорма, 
					, ,
					ОписаниеОпопвещенияВыбора,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВыбораЗначенияРеквизита(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат;  
		Записать();
		ЭтотОбъект[ДополнительныеПараметры.ИмяЭлемента] = Новый ФорматированнаяСтрока(Строка(Результат), 
																				Новый Шрифт(, 12, , , Истина), 
																				);
	КонецЕсли;	
	
КонецПроцедуры // ОбработкаВыбораЗначенияРеквизита()     

&НаСервере
Процедура ОтобразитьГрафикАктивности()
	
	Справочники.ИнформационныеБазы.ПолучитьГрафикПоказателейАктивности(Объект.Ссылка, СводнаяИнформация);

КонецПроцедуры // ОтобразитьГрафикАктивности()

&НаКлиенте
Процедура КомандаРедактировать(Команда)

	ПолучитьСвойстваИнформационнойБазы();
	//Прототип_ПолучитьПараметрыКонфигурацииНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Прототип_ПолучитьПараметрыКонфигурацииНаСервере(ИнформационнаяБаза)
	
	КаталогФайловБазы = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ПолучитьРазделительПутиСервера(); 
	
	СоздатьКаталог(КаталогФайловБазы);
	
	
	
	
	УдалитьФайлы(КаталогФайловБазы);	
	

КонецПроцедуры // Прототип_ПолучитьПараметрыКонфигурацииНаСервере()

&НаСервере
Процедура ПолучитьСвойстваИнформационнойБазы()
	
	Отказ = Ложь;
	Адимнистрирование_ИнформационнаяБаза = АдминистрированиеИнформационныхБаз.ПолучитьСвойстваИнформационнойБазы(Объект.Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаРегламентныхЗаданий	= Адимнистрирование_ИнформационнаяБаза.БлокировкаРегламентныхЗаданий;
	БлокировкаНачалаСеансов		= Адимнистрирование_ИнформационнаяБаза.ВключенаБлокировкаНачалаСеансов;
	
	СеансыИнформационнойБазы = Адимнистрирование_ИнформационнаяБаза.ПолучитьСеансы();
	КоличествоАктивныхСеансов = СеансыИнформационнойБазы.Количество();	

КонецПроцедуры

   
