 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		
		ТекущаяСтраницаПараметров = "ГруппаИнформация";
		
	КонецЕсли;    
	
	СводнаяИнформация = Справочники.ИнформационныеБазы.ПолучитьМакет("МакетПоказателей");
	
	//Отладка
	УстановитьОтображениеНезаполненныхЭлементов();	
	
	ЖурналРегистрации = "ClickHouse";
	
	ОбъемБазы = "4.7 Гб (из 11 Гб)";
	КоличествоАктивныхСеансов = 18;
	Объект.ИспользуетсяПо = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры   
 
&НаСервере
Процедура УстановитьОтображениеНезаполненныхЭлементов()
	
	СписокПроверяемыхРеквизитов = Новый Соответствие;
	СписокПроверяемыхРеквизитов.Вставить("", "");

КонецПроцедуры // УстановитьОтображениеНезаполненныхЭлементов()
