
&НаКлиенте
Процедура ТекущаяСтраницаПараметровПриИзменении(Элемент)
	
	ОтобразитьТекущуюСтраницуПоказателей();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьТекущуюСтраницуПоказателей();     
	
	Состояние = "Активна";
	
КонецПроцедуры        

&НаКлиенте
Процедура ОтобразитьТекущуюСтраницуПоказателей()
	
	Если ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		Элементы.ГруппаПросмотра.ТекущаяСтраница = Элементы[ТекущаяСтраницаПараметров];
	КонецЕсли;
	
КонецПроцедуры // ОтобразитьТекущуюСтраницуПоказателей()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		
		ТекущаяСтраницаПараметров = "ГруппаИнформация";
		
	КонецЕсли;
	
КонецПроцедуры



