 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		
		ТекущаяСтраницаПараметров = "ГруппаИнформация";
		
	КонецЕсли;    
	
	СводнаяИнформация = Справочники.ИнформационныеБазы.ПолучитьМакет("МакетПоказателей");
	
	//Отладка
	
	
	ПоследнийБэкап = ТекущаяДата();
	ДатаПоследнегоИспользования = ТекущаяДата();
	
	ОбъемБазы = "4.7 Гб"
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьТекущуюСтраницуПоказателей();     
	
	Состояние = "Активна";
	
КонецПроцедуры   
 
&НаКлиенте
Процедура ТекущаяСтраницаПараметровПриИзменении(Элемент)
	
	ОтобразитьТекущуюСтраницуПоказателей();
	
КонецПроцедуры  


&НаКлиенте
Процедура ОтобразитьТекущуюСтраницуПоказателей()
	
	Если ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		Элементы.ГруппаПросмотра.ТекущаяСтраница = Элементы[ТекущаяСтраницаПараметров];
	КонецЕсли;
	
КонецПроцедуры // ОтобразитьТекущуюСтраницуПоказателей()




