	
	
#Область ПрограммныйИнтерфейс

//Функция ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза) Экспорт
//	
//	ПараметрыАдминистрированияИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
//	ПараметрыАдминистрированияИБ.ИмяВКластере							= ИнформационнаяБаза.ИмяВКластере;
//	ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы		= ИнформационнаяБаза.ИмяПользователяИБ;
//	ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы	= ИнформационнаяБаза.ПарольПользователяИБ;		
//	
//	Возврат ПараметрыАдминистрированияИБ;
//	
//КонецФункции

//Функция ПолучитьПараметрыИнформационнойБазы(ИнформационнаяБаза) Экспорт
//	
//	ПараметрыАдминистрированияКластера	= Справочники.Кластеры1С.ПолучитьПараметрыАдминистрированияКластера(ИнформационнаяБаза.Кластер1С);
//	ПараметрыАдминистрированияИБ		= ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза);
//	
//	СвойставаИБ = АдминистрированиеКластера.СвойстваИнформационнойБазы(ПараметрыАдминистрированияИБ, 
//																ПараметрыАдминистрированияКластера);
//																                 
//	Возврат СвойставаИБ;
//																															
//КонецФункции    





Процедура ПолучитьГрафикПоказателейАктивности(ИнформационнаяБаза, ОбластьТабличногоДокумента, ДополнительныеПараметры = Неопределено) Экспорт
	
	//#TODO Обработать следующие виды приложений:
	//	1CV8 - идентификатор приложения "1С:Предприятие";
	//	1CV8C - идентификатор приложения тонкого клиента "1С:Предприятие";
	//	AgentStandardCall – стандартный вызов;
	//	AnalyticsSystemClient - клиент системы аналитики;
	//	AnalyticsSystemQuery - служебный вызов системы аналитики;
	//	BackgroundJob - идентификатор сессии обработки заданий;
	//	COMConnection - идентификатор сессии внешнего соединения 1С:Предприятия через COM;
	//	COMConsole - идентификатор административной сессии внешнего соединения;
	//	Debugger - идентификатор сессии отладчика;
	//	DebugQueryTargets - идентификатор приложения для IDE-отладчика по TCP - запрос состава предметов отладки;
	//	Designer - идентификатор приложения Конфигуратор;
	//	HTTPServiceConnection - идентификатор сессии http-сервиса;
	//	ImplAppID - идентификатор приложения для временного сеанса;
	//	JobScheduler - идентификатор сессии планировщика заданий;
	//	MobileClient - идентификатор приложения мобильного клиента "1С:Предприятие";
	//	ODataConnection - идентификатор сессии OData-сервиса;
	//	OpenIDProvider - идентификатор провайдера OpenID;
	//	RAS - идентификатор сервера администрирования;
	//	RemoteDebugger - идентификатор приложения для IDE-отладчика по TCP;
	//	SrvrConsole - идентификатор сессии консоли кластера;
	//	SystemBackgroundJob - идентификатор системного фонового задания;
	//	WebClient - идентификатор приложения web-клиента 1С:Предприятие;
	//	WebServerExtension - идентификатор приложения модуля расширения веб-сервера;
	//	WSConnection - идентификатор сессии web-сервиса.
	
	ОбластьТабличногоДокумента.Очистить();
	
	СхемаКомпоновкиДанных = Справочники.ИнформационныеБазы.ПолучитьМакет("МакетКомпановкиДиаграммыПоказателей");     
	
	СхемаКомпоновкиДанных.Параметры["ИнформационнаяБаза"].Значение = ИнформационнаяБаза;
	
	ДанныеРасшифровки	= Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Настройки	= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ОбластьТабличногоДокумента);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	РисунокДиаграммы = ОбластьТабличногоДокумента.Рисунки[0];
	
	РисунокДиаграммы.Высота	= 45;
	РисунокДиаграммы.Ширина	= 100;  
	
	РисунокДиаграммы.Объект.ОбластьЛегенды.Шрифт = Новый Шрифт(, 8);
	РисунокДиаграммы.Объект.ОбластьЛегенды.ЦветТекста = ЦветаСтиля.ЦветПустойГиперссылки;
	
	РисунокДиаграммы.Имя = "Динамика активности сеансов";
	

КонецПроцедуры


#КонецОбласти

