	
	
#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза) Экспорт
	
	ПараметрыАдминистрированияИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыАдминистрированияИБ.ИмяВКластере							= ИнформационнаяБаза.ИмяВКластере;
	ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы		= ИнформационнаяБаза.ИмяПользователяИБ;
	ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы	= ИнформационнаяБаза.ПарольПользователяИБ;		
	
	Возврат ПараметрыАдминистрированияИБ;
	
КонецФункции

Функция ПолучитьПараметрыИнформационнойБазы(ИнформационнаяБаза) Экспорт
	
	ПараметрыАдминистрированияКластера	= Справочники.Кластеры1С.ПолучитьПараметрыАдминистрированияКластера(ИнформационнаяБаза.Кластер1С);
	ПараметрыАдминистрированияИБ		= ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза);
	
	СвойставаИБ = АдминистрированиеКластера.СвойстваИнформационнойБазы(ПараметрыАдминистрированияИБ, 
																ПараметрыАдминистрированияКластера);
																                 
	Возврат СвойставаИБ;
																															
КонецФункции

Процедура ПолучитьГрафикПоказателейАктивности(ИнформационнаяБаза, ОбластьТабличногоДокумента, ДополнительныеПараметры = Неопределено) Экспорт
		
	ОбластьТабличногоДокумента.Очистить();
	
	СхемаКомпоновкиДанных = Справочники.ИнформационныеБазы.ПолучитьМакет("МакетКомпановкиДиаграммыПоказателей");     
	
	СхемаКомпоновкиДанных.Параметры["ИнформационнаяБаза"].Значение = ИнформационнаяБаза;
	
	ДанныеРасшифровки	= Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Настройки	= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ОбластьТабличногоДокумента);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	РисунокДиаграммы = ОбластьТабличногоДокумента.Рисунки[0];
	
	//РисунокДиаграммы.Лево	= 5;
	РисунокДиаграммы.Высота	= 45;
	РисунокДиаграммы.Ширина	= 100;  
	
	//РисунокДиаграммы.Объект.ОбластьПостроения.ШкалаТочек.ШагШкалы = 5;
	
	РисунокДиаграммы.Объект.ОбластьЛегенды.Шрифт = Новый Шрифт(, 8);
	РисунокДиаграммы.Объект.ОбластьЛегенды.ЦветТекста = ЦветаСтиля.ЦветПустойГиперссылки;
	
	РисунокДиаграммы.Имя = "Динамика активности сеансов";
	
	//СтруктураРасшифровки.ГрафикаСкорости = ДанныеРасшифровки;

КонецПроцедуры


#КонецОбласти

