	
	
#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза) Экспорт
	
	ПараметрыАдминистрированияИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыАдминистрированияИБ.ИмяВКластере							= ИнформационнаяБаза.ИмяВКластере;
	ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы		= ИнформационнаяБаза.ИмяПользователяИБ;
	ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы	= ИнформационнаяБаза.ПарольПользователяИБ;		
	
	Возврат ПараметрыАдминистрированияИБ;
	
КонецФункции

Функция ПолучитьПараметрыИнформационнойБазы(ИнформационнаяБаза) Экспорт
	
	ПараметрыАдминистрированияКластера	= Справочники.Кластеры1С.ПолучитьПараметрыАдминистрированияКластера(ИнформационнаяБаза.Кластер1С);
	ПараметрыАдминистрированияИБ		= ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза);
	
	СвойставаИБ = АдминистрированиеКластера.СвойстваИнформационнойБазы(ПараметрыАдминистрированияИБ, 
																ПараметрыАдминистрированияКластера);
																                 
	Возврат СвойставаИБ;
																															
КонецФункции

#КонецОбласти

