
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.ВПодготовке;
	ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторБазы) Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.Отключена;
	ИначеЕсли Статус = Перечисления.СтатусыИнформационнойБазы.Активна Тогда
		// Статус остается	
	Иначе
		Статус = Перечисления.СтатусыИнформационнойБазы.Активна;	
	КонецЕсли;  
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры     

Функция ПроверитьЗаполнениеРеквизитов()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ИмяИБ");
	МассивРеквизитов.Добавить("СерверБД");
	МассивРеквизитов.Добавить("БазаДанных");
	МассивРеквизитов.Добавить("Назначение");
	МассивРеквизитов.Добавить("Ответственный");

	Для Каждого ПроверяемыйРеквизит Из МассивРеквизитов Цикл
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ПроверяемыйРеквизит]) Тогда
			Возврат Ложь;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // ПроверитьЗаполнениеРеквизитов()

