
Процедура ПередЗаписью(Отказ)
	
	Если Не ПроверитьЗаполнение() Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.ВПодготовке;
	ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторБазы) Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.Зарегистрирована;
	ИначеЕсли Статус = Перечисления.СтатусыИнформационнойБазы.Зарегистрирована Тогда
		// Статус остается	
	Иначе
		Статус = Перечисления.СтатусыИнформационнойБазы.Подключена;	
	КонецЕсли;  
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры
