
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.ВПодготовке;
	ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторБазы) Тогда
		Статус = Перечисления.СтатусыИнформационнойБазы.Отключена;
	ИначеЕсли Статус = Перечисления.СтатусыИнформационнойБазы.Активна Тогда
		// Статус остается	
	Иначе
		Статус = Перечисления.СтатусыИнформационнойБазы.Активна;	
	КонецЕсли;  
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры
