 
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения); 
	КоличествоДнейИспользования = 1;
	
КонецПроцедуры
 
&НаКлиенте
Процедура КоличествоДнейИспользованияПриИзменении(Элемент)
	
	ОтобразитьДнейИспользования();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДнейИспользования()
	
	Элементы.КоличествоДнейИспользования.Заголовок = "Срок использования (" + Строка(КоличествоДнейИспользования) + " дн.)";
	Объект.ИспользуетсяПо = НачалоДня(ТекущаяДата()) + КоличествоДнейИспользования * 24*60*60;	

КонецПроцедуры // ОтобразитьДнейИспользования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	ОтобразитьДнейИспользования();
	
КонецПроцедуры
