
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПараметрыЗапуска) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыЗапуска);
	Иначе
		ВариантАутентификации = 0;
		ОсновнойРежимЗапуска = "Auto";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ВариантАутентификации",			ВариантАутентификации);
	ПараметрыЗапуска.Вставить("Версия",						Версия);
	ПараметрыЗапуска.Вставить("ДополнительныеПараметрыЗапуска",	ДополнительныеПараметрыЗапуска);
	ПараметрыЗапуска.Вставить("ОсновнойРежимЗапуска",			ОсновнойРежимЗапуска);
	ПараметрыЗапуска.Вставить("Разрядность",					Разрядность);
	
	Закрыть(ПараметрыЗапуска);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();

КонецПроцедуры
