
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЕСТ_ЗаполнитьТаблицу(Справочники.Операции.ЗавершениеРаботыПользователей, -1, 0);
	ТЕСТ_ЗаполнитьТаблицу(Справочники.Операции.УстановкаБлокировкиСоединения, -1, 0);
	ТЕСТ_ЗаполнитьТаблицу(Справочники.Операции.СозданиеИнформационнойБазы, 3, 2);
	ТЕСТ_ЗаполнитьТаблицу(Справочники.Операции.УдалениеИнформационнойБазы, 3, 2);
	ТЕСТ_ЗаполнитьТаблицу(Справочники.Операции.СнятиеБлокировкиСоединения, 3, 2);
	
	
КонецПроцедуры   


&НаСервере
Процедура ТЕСТ_ЗаполнитьТаблицу(Операция, ИндексКартинки, РезультатВыполнеия)
	
	НоваяСтрока = ТаблицаОпераций.Добавить();
	НоваяСтрока.Операция = Операция;	
	НоваяСтрока.ИндексКартинки = ИндексКартинки; 
	НоваяСтрока.РезультатВыполнеия = РезультатВыполнеия;

КонецПроцедуры // ТЕСТ_ЗаполнитьТаблицу()


&НаКлиенте
Процедура КомандаТест(Команда)
	
	Элементы.ТаблицаОпераций.ТекущаяСтрока = 2;
	ТаблицаОпераций[2].РезультатВыполнеия = 1;
	
КонецПроцедуры

