
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Параметры.ДополнительныеПараметры.Свойство("ПараметрыБазы") Тогда
			Кластер = Параметры.ДополнительныеПараметры.Кластер;
			Объект.Кластер1С			= Кластер;
			Объект.ИдентификаторБазы	= Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"];
			Объект.ИмяВКластере		= Параметры.ДополнительныеПараметры.ПараметрыБазы["name"];
			Объект.ОписаниеВКластере	= Параметры.ДополнительныеПараметры.ПараметрыБазы["descr"]; 
			Объект.Наименование		= Объект.ИмяВКластере;
			
			РеквизитыНовойБазы = Справочники.ИнформационныеБазы.ПолучитьПараметрыИнформационнойБазы(Объект);
			
			Объект.ИмяНаСервереБД = РеквизитыНовойБазы.БазаДанных;
			Объект.СерверБД = Справочники.СерверыБД.НайтиПоРеквизиту("ИмяСервера", РеквизитыНовойБазы.СерверБД);
			
		КонецЕсли; 
	Иначе
		Если Параметры.ДополнительныеПараметры.Свойство("ПараметрыБазы") Тогда
			Объект.ИдентификаторБазы	= Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"];	
		КонецЕсли;
	КонецЕсли;
	
	//Проверка
	Объект.ИдентификаторБазы	= Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"];
	
	Сообщить(Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"]);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВладелецФормы <> Неопределено Тогда
		Оповестить("РегистрацияБазы");
	КонецЕсли;
	
КонецПроцедуры

