
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Параметры.ДополнительныеПараметры.Свойство("ПараметрыБазы") Тогда
			Кластер = Параметры.ДополнительныеПараметры.Кластер;
			Объект.Владелец			= Кластер;
			Объект.ИдентификаторБазы	= Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"];
			Объект.ИмяИБ				= Параметры.ДополнительныеПараметры.ПараметрыБазы["name"];
			Объект.ОписаниеВКластере	= Параметры.ДополнительныеПараметры.ПараметрыБазы["descr"]; 
			Объект.Наименование		= Объект.ИмяИБ;
			
			РеквизитыНовойБазы = Справочники.ИнформационныеБазы.ПолучитьПараметрыИнформационнойБазы(Объект);
			
			Объект.БазаДанных = РеквизитыНовойБазы.БазаДанных;
			Объект.СерверБД = Справочники.СерверыБД.НайтиПоРеквизиту("ИмяСервера", РеквизитыНовойБазы.СерверБД);
			
		КонецЕсли; 
	Иначе
		Если Параметры.ДополнительныеПараметры.Свойство("ПараметрыБазы") Тогда
			Объект.ИдентификаторБазы	= Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"];	
		КонецЕсли;
		
		УстановитьДоступностьЭлементов();
		
	КонецЕсли;
	
	//Проверка
//	Объект.ИдентификаторБазы	= Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"];
	
	//Сообщить(Параметры.ДополнительныеПараметры.ПараметрыБазы["infobase"]);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()

	МассивПроверяемыхРеквизитов = Новый Массив;
	МассивПроверяемыхРеквизитов.Добавить("СерверБД");
	МассивПроверяемыхРеквизитов.Добавить("БазаДанных");
	МассивПроверяемыхРеквизитов.Добавить("Владелец");
	МассивПроверяемыхРеквизитов.Добавить("ИмяИБ");
	МассивПроверяемыхРеквизитов.Добавить("ИмяАдминистратораИБ");
	МассивПроверяемыхРеквизитов.Добавить("ПарольАдминистратораИБ");
	МассивПроверяемыхРеквизитов.Добавить("ХранилищеКонфигурации");
	МассивПроверяемыхРеквизитов.Добавить("ВебСервер"); 
	
	Для Каждого ПроверяемыйРеквизит Из МассивПроверяемыхРеквизитов Цикл
		
		Элементы[ПроверяемыйРеквизит].Доступность = Не ЗначениеЗаполнено(Объект[ПроверяемыйРеквизит]);
		
	КонецЦикла;
	

КонецПроцедуры // УстановитьДоступностьЭлементов()



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВладелецФормы <> Неопределено Тогда
		Оповестить("РегистрацияБазы");
	КонецЕсли;
	
КонецПроцедуры

