
Функция ИнициализироватьТаблицуСеансов()
	
	ТаблицаСеансов = Новый ТаблицаЗначений;  
	
	ТаблицаСеансов.Колонки.Добавить("IPАдресКлиента",					ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ТаблицаСеансов.Колонки.Добавить("ВремяНачала",						ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаСеансов.Колонки.Добавить("ВремяПоследнейАктивности",			ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	ТаблицаСеансов.Колонки.Добавить("ИдентификаторИнформационнойБазы",	Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаСеансов.Колонки.Добавить("ИдентификаторПроцесса",				Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаСеансов.Колонки.Добавить("ИдентификаторСеанса",				Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаСеансов.Колонки.Добавить("ИдентификаторСоединения",			Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	ТаблицаСеансов.Колонки.Добавить("ИмяКомпьютера",					ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСеансов.Колонки.Добавить("ИмяПользователя",					ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСеансов.Колонки.Добавить("ИмяПриложения",					ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСеансов.Колонки.Добавить("ИмяТекущегоСервиса",				ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	ТаблицаСеансов.Колонки.Добавить("ДлительностьВызововВсего",					ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ДлительностьВызововСервисовВсего",			ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ДлительностьВызововСУБДВсего",				ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("КоличествоВызововВсего",					ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ОбъемДанныхЗаписанныхНаДискВсего",			ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ОбъемДанныхПереданныхИПолученныхСУБДВсего",	ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ОбъемДанныхСчитанныхСДискаВсего",			ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ПотреблениеПамятиВсего",						ОбщегоНазначения.ОписаниеТипаЧисло(15));	ТаблицаСеансов.Колонки.Добавить("ПроцессорноеВремяВсего",					ОбщегоНазначения.ОписаниеТипаЧисло(15));
	
	ТаблицаСеансов.Колонки.Добавить("Лицензии",							ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаСеансов.Колонки.Добавить("СоединениеСУБД",					ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСеансов.Колонки.Добавить("СпящийСеанс",						Новый ОписаниеТипов("Булево")); 
	ТаблицаСеансов.Колонки.Добавить("АктивныйСеансПользователя",						Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаСеансов;
	
КонецФункции
	
Функция ПолучитьТаблицуАктивныхСеансовКластера(Кластер) Экспорт
	
	ТаблицаСеансов = ИнициализироватьТаблицуСеансов();
	Отказ = Ложь;
	ЭлементАдминистрированиеКластера = АдминистрированиеСерверов.ПолучитьАдиминистрированиеКластера(Кластер, Отказ);
	Если Отказ Тогда
		Возврат ТаблицаСеансов;		
	КонецЕсли;	
		
	АктивныеСеансы = ЭлементАдминистрированиеКластера.ПолучитьСеансы();
	
	Для Каждого ОписаниеСеанса Из АктивныеСеансы Цикл 
		СтрокаТаблицыСеансов = ТаблицаСеансов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыСеансов, ОписаниеСеанса);  
		СтрокаТаблицыСеансов.АктивныйСеансПользователя = ПроверитьАктивностьСеанса(ОписаниеСеанса);
	КонецЦикла;
	
	Возврат ТаблицаСеансов;
	
КонецФункции  

Функция ПроверитьАктивностьСеанса(ОписаниеСеанса) 
	
	Возврат (ОписаниеСеанса.ИмяПриложения = "1CV8"
			Или ОписаниеСеанса.ИмяПриложения = "1CV8C"
			Или ОписаниеСеанса.ИмяПриложения = "Designer")
				И НЕ ОписаниеСеанса.СпящийСеанс;

КонецФункции

Функция ПолучитьТаблицуСеансовИнформационнойБазы(ИнформационнаяБаза) Экспорт

	ТаблицаСеансов = ИнициализироватьТаблицуСеансов();
	
	Отказ = Ложь;
	Адимнистрирование_ИнформационнаяБаза = АдминистрированиеИнформационныхБаз.ПолучитьАдминистрированиеИнформационнойБазы(ИнформационнаяБаза, Отказ);
	СеансыИнформационнойБазы = Адимнистрирование_ИнформационнаяБаза.ПолучитьСеансы();
	
	Для Каждого СеансИнформационнойБазы Из СеансыИнформационнойБазы Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСеансов.Добавить(), СеансИнформационнойБазы);
	КонецЦикла;
	
	Возврат ТаблицаСеансов;
	
КонецФункции

