

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрукутараПараметров = Константы.ОбщиеПараметрыАутентификации.ПолучитьСтруктуруНастроекПоУмолчанию(); 
	Если ЗначениеЗаполнено(СтрукутараПараметров) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтрукутараПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыНаСервере()
	
	СтруктураПараметров = Константы.ОбщиеПараметрыАутентификации.ПолучитьОписаниеСтруктурыПараметров(); 
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	Константы.ОбщиеПараметрыАутентификации.ЗаписатьСтруктуруНастроекПоУмолчанию(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ЗаписатьПараметрыНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
