

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрукутараПараметров = Константы.ОбщиеПараметрыАутентификации.Получить().Получить(); 
	Если ЗначениеЗаполнено(СтрукутараПараметров) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтрукутараПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыНаСервере()
	
	СтруктураПараметров = Новый Структура("ПарольСервераАдминистрирования,
									|ПарольСУБД,
									|ПарольЦентральногоСервера,
									|ПользовательИБ,
									|ПользовательСервераАдминистрирования,
									|ПользовательСУБД,
									|ПользовательЦентральногоСервер,
									|ПарольИБ"); 
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	
	Константы.ОбщиеПараметрыАутентификации.Установить(Новый ХранилищеЗначения(СтруктураПараметров));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ЗаписатьПараметрыНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
