// @strict-types


#Область ПрограммныйИнтерфейс

// Получить агента администрирования кластера.
// 
// Параметры:
//  ПараметрыПодключения - Структура - Параметры подключения:
//  *АдресСервераАдминистрирования - Строка
//  *ПортСервераАдминистрирования - Число
//  *ПользовательЦентральногоСервер - Строка
//  *ПарольЦентральногоСервера - Строка
//  *Ссылка - СправочникСсылка.Кластеры1С
//  
//  Отказ - Булево - Отказ
// 
// Возвращаемое значение:
//  АдминистрированиеСервера - Получить агента администрирования кластера
Функция ПолучитьАгентаАдминистрированияКластера(ПараметрыПодключения, Отказ = Ложь) Экспорт
	
	Попытка
		АгентАдминистрирования = Новый АдминистрированиеСервера(ПараметрыПодключения.АдресСервераАдминистрирования,
														ПараметрыПодключения.ПортСервераАдминистрирования);
	Исключение
		ЗаписьЖурналаРегистрации("ПодключениеКСерверуАдминистрирования",
								УровеньЖурналаРегистрации.Ошибка,
								,
								ПараметрыПодключения.АдресСервераАдминистрирования,
								ОписаниеОшибки());
		Правило = Справочники.ПравилаПроверкиОбъектов.ДоступностьСервераАдминистрированияКластера;
		ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(ПараметрыПодключения.Ссылка, Правило);
	КонецПопытки;	
		
	Попытка
		АгентАдминистрирования.ВыполнитьАутентификацию(ПараметрыПодключения.ПользовательЦентральногоСервер,
													ПараметрыПодключения.ПарольЦентральногоСервера);
	Исключение
		Отказ = Истина;
		Правило = Справочники.ПравилаПроверкиОбъектов.АвторизацияСервераАдминистрирования;
		ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(ПараметрыПодключения.Ссылка, Правило);
	КонецПопытки;
	
	Возврат АгентАдминистрирования;
	
КонецФункции

Функция ПолучитьАдминистрированиеИнформационнойБазы(ИнформационнаяБаза, Отказ = Ложь) Экспорт
	
	ИдентификаторИнформационнойБазы = ИнформационнаяБаза.ИдентификаторБазы;
	МассивИнформационныхБаз = АдминистрированиеЭлементовКластера.ПолучитьБазыКластера(ИнформационнаяБаза.Владелец);
	Для Каждого АдминистрированиеИнформационнойБазы Из МассивИнформационныхБаз Цикл
		
		Если АдминистрированиеИнформационнойБазы.ИдентификаторИнформационнойБазы = ИдентификаторИнформационнойБазы Тогда
			Попытка
				АдминистрированиеИнформационнойБазы.ВыполнитьАутентификацию(ИнформационнаяБаза.ИмяПользователяИБ, ИнформационнаяБаза.ПарольПользователяИБ);
			Исключение
				Отказ = Истина;
			КонецПопытки;
			
			Возврат АдминистрированиеИнформационнойБазы;	
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Неопределено;

КонецФункции // ПолучитьАдминистрированиеИнформационнойБазы

#КонецОбласти


