
Функция ПолучитьПараметрыАвторизации(Объект, Пользователь) Экспорт
	
	СтруктураАвторизации = Новый Структура("ИмяПользователя, Пароль");
	
	// REF Хранение пароля Администратора базы перенести в регистр
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ИнформационныеБазы") Тогда
		СтруктураАвторизации.ИмяПользователя	= Объект.ИмяПользователяИБ;
		СтруктураАвторизации.Пароль			= Объект.ПарольПользователяИБ;
		
		Возврат СтруктураАвторизации;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ХранилищеПаролей.ИмяПользователя КАК ИмяПользователя,
				|	ХранилищеПаролей.Пароль КАК Пароль
				|ИЗ
				|	РегистрСведений.ХранилищеПаролей КАК ХранилищеПаролей
				|ГДЕ
				|	ХранилищеПаролей.ОбъектДоступа = &Объект
				|	И ХранилищеПаролей.ПользовательИБ = &Пользователь";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураАвторизации.ИмяПользователя	= Выборка.ИмяПользователя;
		СтруктураАвторизации.Пароль			= Выборка.Пароль;	
	КонецЕсли;
	
	Возврат СтруктураАвторизации;
	
КонецФункции