
#Область ПрограммныйИнтерфейс

// Выполнить скрипт на сервере.
// 
// Параметры:
//  Скрипт - Строка - Текст скрипта
// 
// Возвращаемое значение:
//  Структура - Выполнить скрипт на сервере:
// * КодВозврата - Число, Неопределено -
// * ПотокВывода - Строка, Неопределено -
// * ПотокОшибок - Строка, Неопределено -
Функция ВыполнитьСкрипт(ТекстСкрипта) Экспорт
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы(); 
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(ТекстСкрипта, ПараметрыЗапускаПрограммы);  
	
КонецФункции // ВыполнитьСкриптНаСервере()

// Получить каталог программы.
// 
// Параметры:
//  ВерсияПлатформы - Строка - Версия платформы
// 
// Возвращаемое значение:
// 	Строка - Путь к каталогу исполняемых файлов 1С на сервере
//  
Функция ПолучитьКаталогПрограммы() Экспорт

	ПараметрыСистемы = Новый СистемнаяИнформация;
	
	Если ПараметрыСистемы.ТипПлатформы = ТипПлатформы.Windows_x86 
		Или ПараметрыСистемы.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ПутьККаталогуПрограммы = "C:\Program Files\1cv8\%Platform%\bin\";
	ИначеЕсли ПараметрыСистемы.ТипПлатформы = ТипПлатформы.MacOS_x86 
		Или ПараметрыСистемы.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
		ПутьККаталогуПрограммы = "/opt/1cv8/%Platform%/";
	Иначе
		ПутьККаталогуПрограммы = "/opt/1cv8/x86_64/%Platform%/";
	КонецЕсли;
	
	Возврат ПутьККаталогуПрограммы;
	 
КонецФункции	

#КонецОбласти 