 
 
 
Функция ПолучитьОписаниеСтруктурыПараметров() Экспорт
	
	СтруктураПараметров = Новый Структура("ПользовательСервераАдминистрирования,
									|ПарольСервераАдминистрирования, 
									|ПользовательСУБД,
									|ПарольСУБД,
									|ПользовательЦентральногоСервер,
									|ПарольЦентральногоСервера,
									|ПользовательИБ,
									|ПарольИБ");
	
	Возврат СтруктураПараметров;
	
КонецФункции


Функция ПолучитьСтруктуруНастроекПоУмолчанию() Экспорт
	
	СохраненнаяСтрукутара = Константы.ОбщиеПараметрыАутентификации.Получить().Получить();
	СтруктураПараметров = ПолучитьОписаниеСтруктурыПараметров();

	Если ЗначениеЗаполнено(СохраненнаяСтрукутара) Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, СохраненнаяСтрукутара);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции  

Процедура ЗаписатьСтруктуруНастроекПоУмолчанию(СтруктураПараметров) Экспорт

	СтруктураПараметров = ПолучитьОписаниеСтруктурыПараметров();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, СтруктураПараметров);		
	
	Константы.ОбщиеПараметрыАутентификации.Установить(Новый ХранилищеЗначения(СтруктураПараметров));

КонецПроцедуры      


