
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ИнформационнаяБаза) = Тип("Массив")
		И Параметры.ИнформационнаяБаза.Количество() = 1 Тогда
		ИнформационнаяБаза = Параметры.ИнформационнаяБаза[0];
	КонецЕсли;
		
	// TODO Обрабатывать массив информационных баз
	
	ТекстОписания = Новый ФорматированнаяСтрока("Информационная база ", 
															Новый ФорматированнаяСтрока(Строка(ИнформационнаяБаза), 
																								Новый Шрифт(,,Истина)),
															" будет перенесена в кластер ",
															Новый ФорматированнаяСтрока(Строка(Параметры.Кластер1С), 
																								Новый Шрифт(,,Истина)),		
															". Продолжить?");
																
	Элементы.ОписаниеДействия.Заголовок = ТекстОписания;

КонецПроцедуры

