
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСБуферомОбменаКлиентСервер.ДобавитьЭлементыФормыДляHTMLБуфера(ЭтотОбъект, Элементы);
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СтраницаРежимаФормы.ТекущаяСтраница = Элементы.СтраницаРедактирования;
	Иначе
		Элементы.СтраницаРежимаФормы.ТекущаяСтраница = Элементы.СтраницаПросмотра;
	КонецЕсли;
	
	ПолучитьКартинкуПоURL();
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьКартинкуПоURL()
	
	Если ЗначениеЗаполнено(Объект.URLФотографии) Тогда 
		
		//Если СтрНачинаетсяС(Объект.URLФотографии, "https://") Тогда
		//	Сервер = СтрЗаменить(Объект.URLФотографии, "https://", "");
		//ИначеЕсли СтрНачинаетсяС(Объект.URLФотографии, "http://") Тогда
		//	Сервер = СтрЗаменить(Объект.URLФотографии, "http://", "");
		//КонецЕсли;
		//
		//ПутьСервер = СтрРазделить(Сервер, "/");
		//Соединение = Новый HTTPСоединение(ПутьСервер[0]);
		//Запрос = Новый HTTPЗапрос(Объект.URLФотографии);
		//Ответ = Соединение.Получить(Запрос);
		//ДвоичныеДанныеКартинки = Ответ.ПолучитьТелоКакДвоичныеДанные();
		//
		//
		//
		//Фотография = Новый Картинка(ДвоичныеДанныеКартинки);
		//
		//Фотография.Записать("C:\Temp1C\1.jpg");
		АдресФотографии = Объект.URLФотографии;
		//АдресФотографии = ПоместитьВоВременноеХранилище(Фотография, УникальныйИдентификатор); 
	Иначе
		АдресФотографии = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПользовательБезФотографии, УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры // ПолучитьКартинкуПоURL()


&НаКлиенте
Процедура РедактироватьРеквизиты(Команда)
	
	Элементы.СтраницаРежимаФормы.ТекущаяСтраница = Элементы.СтраницаРедактирования;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЗначениеВБуфер(Значение)

	РаботаСБуферомОбменаКлиентСервер.СкопироватьВБуферОбмена(Значение, ЭтотОбъект["ПолеHTMLБуфера"]);

КонецПроцедуры // СкопироватьЗначениВБуфер()

&НаКлиенте
Процедура ПочтаПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.Почта);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.Телефон);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяВДоменеПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.ИмяВДомене);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОСПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.ПользовательОС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
   

	
КонецПроцедуры
