// @strict-types


#Область ПрограммныйИнтерфейс

// Проверить актуальность зарегистрированных баз.
// 
// Параметры:
//  Кластер - СправочникСсылка.Кластеры1С
//  ИдентификаторыБаз - УникальныйИдентификатор
Процедура ПроверитьАктуальностьЗарегистрированныхБаз(Кластер, ИдентификаторыБаз) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза
						|ИЗ
						|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
						|ГДЕ
						|	НЕ ИнформационныеБазы.ИдентификаторБазы В (&ИдентификаторыБаз)
						|	И ИнформационныеБазы.Владелец = &Кластер1С";
	
	Запрос.УстановитьПараметр("Кластер1С",				Кластер);
	Запрос.УстановитьПараметр("ИдентификаторыБаз",	ИдентификаторыБаз);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Правило = Справочники.ПравилаПроверкиОбъектов.РегистрацияИнформационнойБазы;
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьРезультатПроверки(Выборка.ИнформационнаяБаза, Правило);		
	КонецЦикла;
		
КонецПроцедуры

// Проверить доступность серверов.
Процедура ПроверитьДоступностьСерверов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	Кластеры1С.Ссылка КАК Кластер1С,
						|	Кластеры1С.АдресСервераАдминистрирования КАК АдресСервераАдминистрирования,
						|	Кластеры1С.ПортСервераАдминистрирования КАК ПортСервераАдминистрирования
						|ИЗ
						|	Справочник.Кластеры1С КАК Кластеры1С
						|ГДЕ
						|	Кластеры1С.Активен";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	Правило = Справочники.ПравилаПроверкиОбъектов.ДоступностьСервераАдминистрированияКластера;		
		
	Пока Выборка.Следующий() Цикл
		Попытка
			АгентАдминистрирования = Новый АдминистрированиеСервера(Выборка.АдресСервераАдминистрирования,
														Выборка.ПортСервераАдминистрирования);
			ПроверитьАвторизациюСервераАдминистрирования(АгентАдминистрирования);	
		Исключение
			ЗаписатьРезультатПроверки(Выборка.Кластер1С, Правило);	
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьАвторизациюСервераАдминистрирования(АгентАдминистрирования) 
	//TODO: Реализация
КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


// Записать результат проверки.
// 
// Параметры:
//  ОбъектКластера - СправочникСсылка.ИнформационныеБазы,
//			 - СправочникСсылка.Кластеры1С,
//  		 - 	СправочникСсылка.СерверыБД,
//  		 - 	СправочникСсылка.ПользователиИБ,
//  		 - 	СправочникСсылка.ВебСерверы,
//  		 - 	СправочникСсылка.ХранилищаКонфигураций - Объект информацио о проверке которого записывается
//  		 
//  Правило - СправочникСсылка.ПравилаПроверкиОбъектов - Правило
Процедура ЗаписатьРезультатПроверки(ОбъектКластера, Правило) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектКластера) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.ПроверкиОбъектов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Объект	= ОбъектКластера;
	ЗаписьРегистра.Правило	= Правило;
	ЗаписьРегистра.Записать(Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
