
&НаКлиенте
Процедура КомандаЗапуститьПредприятие(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнформационнаяБаза = Параметры.ИнформационнаяБаза;	
	СтрокаПодключения = СтрШаблон("Srvr=""%1"";Ref=""%2""", ИнформационнаяБаза.Владелец, ИнформационнаяБаза.ИмяНаСервере1С);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНастройки(Команда)
	
	ПоказыватьНастройки = Не ПоказыватьНастройки;
	
	ВидимостьНастроек();
	
КонецПроцедуры        

&НаКлиенте
Процедура ВидимостьНастроек()
	
	Если ПоказыватьНастройки Тогда
		
		Если ЗапускОтИмениАдминистратора Тогда
			ЗапускОтИмениАдминистратора = Ложь; 
			ВариантАутентификации = 2;
		КонецЕсли;
		
		Элементы.ЗапускОтИмениАдминистратора.Видимость = Ложь;
		Элементы.ГруппаНастройки.Видимость = Истина;
		Элементы.ГруппаКнопок.Видимость = Ложь;
	Иначе
		Элементы.ЗапускОтИмениАдминистратора.Доступность = Истина;	
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ГруппаКнопок.Видимость = Истина;
	КонецЕсли;		
	
КонецПроцедуры // ВидимостьНастроек()




