

Функция ПолучитьПараметрыКластера(Кластер) Экспорт
	
	АдминистрированиеСервера = Новый АдминистрированиеСервера(Кластер.АдресСервераАдминистрирования, Кластер.ПортСервераАдминистрирования);
	АдминистрированиеСервера.ВыполнитьАутентификацию(Кластер.ИмяАдминистратораКластера, Кластер.ПарольАдминистратораКластера);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВерсияПлатформы", АдминистрированиеСервера.ПолучитьВерсию()); 
	
	МассивКласеторов = АдминистрированиеСервера.ПолучитьКластеры();
	Если МассивКласеторов.Количество() = 1 Тогда
		ЭлементМассиваКластеров = МассивКласеторов[0];
		
		ЭлементМассиваКластеров.ВыполнитьАутентификацию(Кластер.ИмяАдминистратораКластера, Кластер.ПарольАдминистратораКластера);
		
		СтруктураПараметров.Вставить("ИмяКомпьютера", ЭлементМассиваКластеров.ИмяКомпьютера);
		СтруктураПараметров.Вставить("ИдентификаторКластера", ЭлементМассиваКластеров.ИдентификаторКластера); 
		СтруктураПараметров.Вставить("Порт", ЭлементМассиваКластеров.Порт);
		СтруктураПараметров.Вставить("ИнформационныеБазы", ЭлементМассиваКластеров.ПолучитьИнформационныеБазы());
	Иначе
		СтруктураПараметров.Вставить("МассивКласеторов", МассивКласеторов);			
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции


