

Функция ПолучитьПараметрыКластера(Кластер) Экспорт
	
	АгентАдминистрирования = ПолучитьАгентаАдминистрированияКластера(Кластер);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВерсияПлатформы", АгентАдминистрирования.ПолучитьВерсию()); 
	
	МассивКласеторов = АгентАдминистрирования.ПолучитьКластеры();
	Если МассивКласеторов.Количество() = 1 Тогда
		ЭлементМассиваКластеров = МассивКласеторов[0];
		
		ЭлементМассиваКластеров.ВыполнитьАутентификацию(Кластер.ИмяАдминистратораКластера, Кластер.ПарольАдминистратораКластера);
		
		СтруктураПараметров.Вставить("ИмяКомпьютера", ЭлементМассиваКластеров.ИмяКомпьютера);
		СтруктураПараметров.Вставить("Имя", ЭлементМассиваКластеров.Имя);
		СтруктураПараметров.Вставить("ИдентификаторКластера", ЭлементМассиваКластеров.ИдентификаторКластера); 
		СтруктураПараметров.Вставить("Порт", ЭлементМассиваКластеров.Порт);
		СтруктураПараметров.Вставить("ИнформационныеБазы", ЭлементМассиваКластеров.ПолучитьИнформационныеБазы());
	Иначе
		СтруктураПараметров.Вставить("МассивКласеторов", МассивКласеторов);			
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции


Функция ПолучитьАгентаАдминистрированияКластера(Кластер) Экспорт
	
	АгентАдминистрирования = Новый АдминистрированиеСервера(Кластер.АдресСервераАдминистрирования, Кластер.ПортСервераАдминистрирования);
	АгентАдминистрирования.ВыполнитьАутентификацию(Кластер.ИмяАдминистратораКластера, Кластер.ПарольАдминистратораКластера);
	
	Возврат АгентАдминистрирования;     
	
КонецФункции        


Функция ПолучитьАдиминистрированиеКластера(Кластер) Экспорт
	
	АгентАдминистрирования = ПолучитьАгентаАдминистрированияКластера(Кластер);	
	МассивКласеторов = АгентАдминистрирования.ПолучитьКластеры();
	Для Каждого ЭлементМассиваКластеров Из МассивКласеторов Цикл
		Если ЭлементМассиваКластеров.ИдентификаторКластера = Кластер.ИдентификаторКластера Тогда
			Попытка
				ЭлементМассиваКластеров.ВыполнитьАутентификацию(Кластер.ИмяАдминистратораКластера, 
															Кластер.ПарольАдминистратораКластера);	
			Исключение
				//#TODO
			КонецПопытки;
			
			Возврат ЭлементМассиваКластеров;
		КонецЕсли;
	КонецЦикла;		
		
КонецФункции
