	 
&НаКлиенте	 
Перем ТекущийВидОтбора;	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтбора = "Кластеры";
	ТекущийВидОтбора = ВидОтбора; 
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаЭлементовКластера, "ТекущийПользователь", ТекущийПользователь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаПроектов, "ТекущийПользователь", ТекущийПользователь,  Истина);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭлементовКластераПриАктивизацииЯчейки(Элемент)
	
	УстановитьОтборПоТаблицеБаз();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьОтборПоТаблицеБаз()

	Если ТекущийВидОтбора <> ВидОтбора Тогда
		
		Для Каждого ЭлементОтбор Из ТаблицаИнформационныхБаз.Отбор.Элементы Цикл
			
			Если ЭлементОтбор.Представление = ТекущийВидОтбора Тогда
				ЭлементОтбор.Использование = Ложь;						
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущийВидОтбора = ВидОтбора;
	
	Если ВидОтбора = "Кластеры" И Элементы.ТаблицаЭлементовКластера.ТекущиеДанные <> Неопределено Тогда      
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаИнформационныхБаз, 
																	"Владелец", 
																	Элементы.ТаблицаЭлементовКластера.ТекущиеДанные.ЭлементКластера,
																	,
																	ВидОтбора, 
																	Истина);  
		
																	
		Если Элементы.ТаблицаЭлементовКластера.ТекущиеДанные.ИндексСостояния = 0 Тогда
			Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаОперацияОжидания;
		Иначе 
			Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаИнформационныеБазы;
		КонецЕсли; 
		
	ИначеЕсли ВидОтбора = "Проекты" И Элементы.ТаблицаПроектов.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаИнформационныеБазы;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаИнформационныхБаз, 
																	"Проект", 
																	Элементы.ТаблицаПроектов.ТекущиеДанные.Проект,
																	,
																	ВидОтбора, 
																	Истина);
	КонецЕсли;

КонецПроцедуры // УстановитьОтборПоТаблицеБаз()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьТекущийОтбор();
	
	//#REF Избавиться от вызова сервера
	ЕстьАктивныеЗадания = ЕстьАктивныеЗаданияДляКластеров();
	//Если ЕстьАктивныеЗадания Тогда
	//	ПодключитьОбработчикОжидания("ПроверитьТекущиеЗаданияКластеров", 3, Ложь);	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьОписаниеЭлемента(ТекущиеДанные)
	
	Кластер = ТекущиеДанные.ЭлементКластера;
	СостояниеКластера = ТекущиеДанные.Состояние;
	
	Если СостояниеКластера <> ПредопределенноеЗначение("Перечисление.СостоянияЭлементовКластера.Активен") Тогда
		Возврат ПолучитьМакетНеактивногоЭлемента();
	КонецЕсли;
	
	Если ТипЗнч(Кластер) = Тип("СправочникСсылка.Кластеры1С") Тогда
		Возврат ЗаполнитьОписаниеКластераНаСервере(Кластер);
	ИначеЕсли ТипЗнч(Кластер) = Тип("СправочникСсылка.ИнформационныеБазы") Тогда	
		
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьМакетНеактивногоЭлемента()

	Возврат Обработки.МониторИнформационныхБаз.ПолучитьМакет("МакетНеактивногоЭлемента");	

КонецФункции // ПолучитьМакетНеактивногоЭлемента()

&НаСервере
Функция ЗаполнитьОписаниеКластераНаСервере(Кластер)
	
	Возврат Справочники.Кластеры1С.ПолучитьМакетОписанияКластера(Кластер);		
	
КонецФункции

&НаКлиенте
Процедура ПолеОписанияЭлементаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОбработки = Неопределено;
	Если Расшифровка.Свойство("ПараметрыБазы", ПараметрыОбработки) Тогда
		//ОбработатьРегистрациюИнформационнойБазы(ПараметрыОбработки);
		
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("ПараметрыБазы", ПараметрыОбработки);
		ДополнительныеПараметры.Вставить("Кластер", Элементы.ТаблицаЭлементовКластера.ТекущиеДанные.ЭлементКластера);
		
		ИнформационнаяБаза = ПолучитьНезарегестрированнуюБазу(ДополнительныеПараметры.Кластер, ПараметрыОбработки["name"]);
		
		ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаОбъекта", Новый Структура("Ключ, ДополнительныеПараметры", ИнформационнаяБаза, ДополнительныеПараметры), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьНезарегестрированнуюБазу(Кластер, ИмяНаСервере1С)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |ГДЕ
	               |	ИнформационныеБазы.Владелец = &Владелец
	               |	И ИнформационныеБазы.ИмяНаСервере1С = &ИмяНаСервере1С";
	
	Запрос.УстановитьПараметр("Владелец", Кластер);
	Запрос.УстановитьПараметр("ИмяНаСервере1С", ИмяНаСервере1С);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ИнформационныеБазы.ПустаяСсылка();
	КонецЕсли;

КонецФункции // ПолучитьНезарегестрированнуюБазу()


&НаКлиенте
Процедура ОбновитьДеревоКластеров(Команда)
	
	Если ВидОтбора = "Кластеры" Тогда
		Элементы.ТаблицаЭлементовКластера.Обновить();
	ИначеЕсли ВидОтбора = "Проекты" Тогда
		Элементы.ТаблицаПроектов.Обновить();
	ИначеЕсли ВидОтбора = "Пользователи" Тогда
		//#REF Обновить таблицу пользователей
	ИначеЕсли ВидОтбора = "Избранное" Тогда
		//#REF Обновить таблицу избранное
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РегистрацияБазы" Тогда
		//#REF Обновить таблицу баз
	ИначеЕсли ИмяСобытия = "РегистрацияИнформационныхБаз" Тогда  
		Элементы.ТаблицаЭлементовКластера.Обновить();
		ОбработатьДлительныеЗадания(Параметр);
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьДлительныеЗадания(Результат)

	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НаименованиеФоновогоЗадания", "ОбработкаЗаданияКластера");
	
	Если Результат.Статус <> "Выполняется" Тогда 
		ПослеЗавершенияДлительногоЗадания(Результат, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ПослеЗавершенияДлительногоЗадания", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, Обработчик, ПараметрыОжидания);

КонецПроцедуры // ОбработатьДлительныеЗадания()

&НаКлиенте
Процедура ПослеЗавершенияДлительногоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		Элементы.ТаблицаЭлементовКластера.Обновить();
		Если Элементы.ТаблицаЭлементовКластера.ТекущиеДанные <> Неопределено
			И Элементы.ТаблицаЭлементовКластера.ТекущиеДанные.ИндексСостояния = 0 Тогда 
			Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаОперацияОжидания;
		Иначе 
			Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаИнформационныеБазы;
		КонецЕсли;                                
		
		Элементы.ТаблицаИнформационныхБаз.Обновить();
	КонецЕсли;				
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТекущиеЗаданияКластеров()

	//#REF Уменьшить передачу данных между клиентом и сервером
	//#REF Запретить повторный запуск обработчикаожидания
	Элементы.ТаблицаЭлементовКластера.Обновить();
	Если Не ЕстьАктивныеЗаданияДляКластеров() Тогда
		ОтключитьОбработчикОжидания("ПроверитьТекущиеЗаданияКластеров"); 
		
		Элементы.ТаблицаИнформационныхБаз.Обновить();
		Если Элементы.ТаблицаЭлементовКластера.ТекущиеДанные.ИндексСостояния = 0 Тогда 
			Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаОперацияОжидания;
		Иначе 
			Элементы.СтраницыИнформацииКластера.ТекущаяСтраница = Элементы.СтраницаИнформационныеБазы;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры      

&НаСервереБезКонтекста
Функция ЕстьАктивныеЗаданияДляКластеров()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекущиеЗаданияОбъектов.ИдентификаторЗадания КАК ИдентификаторЗадания,
	               |	ТекущиеЗаданияОбъектов.Объект КАК Объект
	               |ИЗ
	               |	РегистрСведений.ТекущиеЗаданияОбъектов КАК ТекущиеЗаданияОбъектов
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ТекущиеЗаданияОбъектов.Объект) = ТИП(Справочник.Кластеры1С)";
	
	Результат = Запрос.Выполнить(); 
	Возврат Не Результат.Пустой();

КонецФункции // ЕстьАктивныеЗаданияДляКластеров()

&НаКлиенте
Процедура ТаблицаИнформационныхБазВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнформационнаяБаза = Элементы.ТаблицаИнформационныхБаз.ТекущаяСтрока;
	Если Поле.Имя = "ТаблицаИнформационныхБазПолеНастройка" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаЗапускаПриложения", Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза));
		
		//СписокВыбора = Новый СписокЗначений;	
		//СписокВыбора.Добавить("Запустить", "Запустить", , БиблиотекаКартинок.ВыполнитьЗапуск);
		//СписокВыбора.Добавить("Редактировать", "Редактировать", , БиблиотекаКартинок.Редактировать);
		//СписокВыбора.Добавить("Обслуживание", "Обслуживание", , БиблиотекаКартинок.ВыполнитьСкрипт);

		//Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМеню", ЭтотОбъект, ИнформационнаяБаза);
		//ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент);				 
				 
	Иначе 
	    	ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаОбъекта", 
						Новый Структура("Ключ", ИнформационнаяБаза), 
						Элемент, 
						ЭтаФорма);	
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораИзМеню(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "Запустить" Тогда
		ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаЗапускаПриложения", Новый Структура("ИнформационнаяБаза", Параметры));
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроектовПриАктивизацииЯчейки(Элемент)
	
	УстановитьОтборПоТаблицеБаз();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПриИзменении(Элемент)
	
	ОтобразитьТекущийОтбор();	
	
КонецПроцедуры   

&НаКлиенте
Процедура ОтобразитьТекущийОтбор()

	Если ВидОтбора = "Кластеры" Тогда
		Элементы.ГруппаСтраницыОтборов.ТекущаяСтраница = Элементы.ГруппаКластеры;
	ИначеЕсли ВидОтбора = "Проекты" Тогда
		Элементы.ГруппаСтраницыОтборов.ТекущаяСтраница = Элементы.ГруппаПроекты;
	КонецЕсли;
	
	УстановитьОтборПоТаблицеБаз();

КонецПроцедуры // ОтобразитьТекущийОтбор()


#Область Отладка

&НаКлиенте
Процедура Тест_ПересоздатьКластер(Команда)
	
	Отладка_УдалитьКластер(Элементы.ТаблицаЭлементовКластера.ТекущаяСтрока);
	ОткрытьФорму("Справочник.Кластеры1С.ФормаОбъекта");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура Отладка_УдалитьКластер(Кластер)

	Кластер.ПолучитьОбъект().Удалить();	

КонецПроцедуры // Отладка_УдалитьКластер()

&НаКлиенте
Процедура Тест_ОбновитьРегистрациюБаз(Команда)
	
	РезультатОперации = НачатьРегистрациюБазКластера(Элементы.ТаблицаЭлементовКластера.ТекущаяСтрока);					
	Элементы.ТаблицаЭлементовКластера.Обновить(); 
	УстановитьОтборПоТаблицеБаз();
	ОбработатьДлительныеЗадания(РезультатОперации);
	
КонецПроцедуры 


&НаСервере
Функция НачатьРегистрациюБазКластера(Кластер)
	
	Результат = Справочники.Кластеры1С.НачатьРегистрациюБазКластера(Кластер);
	
	Возврат Результат;
	
КонецФункции // НачатьРегистрациюБазКластера()

#КонецОбласти


&НаКлиенте
Процедура КомандаПроекты(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКластер(Команда)
	
	ОткрытьФорму("Справочник.Кластеры1С.ФормаОбъекта", , ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБазу(Команда)
	
	СтруктураПараметров = Новый Структура; 
	
	Если Элементы.ГруппаСтраницыОтборов.ТекущаяСтраница = Элементы.ГруппаКластеры 
	    И Элементы.ТаблицаЭлементовКластера.ТекущиеДанные <> Неопределено Тогда
		СтруктураПараметров.Вставить("Владелец", Элементы.ТаблицаЭлементовКластера.ТекущаяСтрока);
	ИначеЕсли Элементы.ГруппаСтраницыОтборов.ТекущаяСтраница = Элементы.ГруппаПроекты
		     И Элементы.ТаблицаПроектов.ТекущиеДанные <> Неопределено Тогда	
		СтруктураПараметров.Вставить("Проект", Элементы.ТаблицаПроектов.ТекущаяСтрока);
	КонецЕсли;
	
 	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаНовойБазы", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров), ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрепитьКластер(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроект(Команда)
	
	ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", , ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры













