
&НаКлиенте
Процедура ПрочитатьПараметры(Команда)

	ТекстСкрипта = Объект.ТекстСкрипта;
	Переменные = Новый ТаблицаЗначений;
	КоличествоВхождений = СтрЧислоВхождений(Объект.ТекстСкрипта, "%");
	НачалоПараметра = Ложь;
	ПозицияПредыдущегоСимвола = 0;
    Для СчетчикВхождений = 1 По КоличествоВхождений Цикл
		
		ПозицияТекущегоСимвола = СтрНайти(ТекстСкрипта, "%",,ПозицияПредыдущегоСимвола);

		Если Не НачалоПараметра Тогда
			Параметр = Сред(ТекстСкрипта, ПозицияПредыдущегоСимвола, ПозицияТекущегоСимвола - ПозицияПредыдущегоСимвола);
			НоваяСтрокаПараметров = Переменные.Добавить();
			НоваяСтрокаПараметров.Параметр = Параметр;	
		КонецЕсли;	
		
		НачалоПараметра = Не НачалоПараметра;
	
	КонецЦикла;
	
КонецПроцедуры