ТаблицаБазыКластера.Колонки.Добавить("БлокировкаРегламентныхЗаданий");
ТаблицаБазыКластера.Колонки.Добавить("ВключенаБлокировкаНачалаСеансов");
ТаблицаБазыКластера.Колонки.Добавить("ВремяНачалаБлокировки");
ТаблицаБазыКластера.Колонки.Добавить("ВремяОкончанияБлокировки");
ТаблицаБазыКластера.Колонки.Добавить("ИдентификаторИнформационнойБазы");
ТаблицаБазыКластера.Колонки.Добавить("Имя");
ТаблицаБазыКластера.Колонки.Добавить("ИмяБазыДанных");
ТаблицаБазыКластера.Колонки.Добавить("КодРазрешенияНачалаСеансов");
ТаблицаБазыКластера.Колонки.Добавить("КодЯзыка");
ТаблицаБазыКластера.Колонки.Добавить("ОбязательноеИспользованиеВнешнегоУправленияСеансами");
ТаблицаБазыКластера.Колонки.Добавить("Описание");
ТаблицаБазыКластера.Колонки.Добавить("ПараметрБлокировки");
ТаблицаБазыКластера.Колонки.Добавить("ПарольПользователяБазыДанных");
ТаблицаБазыКластера.Колонки.Добавить("ПользовательБазыДанных");
ТаблицаБазыКластера.Колонки.Добавить("ПрофильБезопасности");
ТаблицаБазыКластера.Колонки.Добавить("ПрофильБезопасностиБезопасногоРежима");
ТаблицаБазыКластера.Колонки.Добавить("РазрешитьВыдачуЛицензий");
ТаблицаБазыКластера.Колонки.Добавить("РезервированиеРабочихПроцессов");
ТаблицаБазыКластера.Колонки.Добавить("СерверБазДанных");
ТаблицаБазыКластера.Колонки.Добавить("СмещениеДат");
ТаблицаБазыКластера.Колонки.Добавить("СоздатьБазуДанных");
ТаблицаБазыКластера.Колонки.Добавить("СообщениеБлокировки");
ТаблицаБазыКластера.Колонки.Добавить("СтрокаПараметровВнешнегоУправленияСеансами");
ТаблицаБазыКластера.Колонки.Добавить("СУБД");
ТаблицаБазыКластера.Колонки.Добавить("УровеньБезопасностиСоединений");


"C:\Program Files\1cv8\common\1cestart.exe" ENTERPRISE /F"G:\1C_Bases\Union_3" /N"Администратор" /URL"e1c://filev/G/1C_Bases/Union_3#e1cib/app/Обработка.СДРНавигаторУпр" /AppAutoCheckMode /AppArch x86_64_prt