
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИнформационнаяБаза = ПараметрКоманды;
	
	ПараметрыЗапуска = ПолучитьПараметрыЗапуска(ИнформационнаяБаза);
	
	СтруктураПараметров = Новый Структура("ПараметрыЗапуска", ПараметрыЗапуска);
	ДополнительныеПараметры = Новый Структура("ИнформационнаяБаза", ИнформационнаяБаза);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработкаПолученныхПараметровЗапуска", 
																			ЭтотОбъект, 
																			ДополнительныеПараметры);
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаДополнительныхПараметровЗапуска", 
					СтруктураПараметров, 
					, , , , 
					ОписаниеОповещенияОЗакрытии, 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученныхПараметровЗапуска(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаписатьПараметрыЗапуска(Результат, ДополнительныеПараметры.ИнформационнаяБаза);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЗапуска(ТекущаяБазы)
	
	ПараметрыЗапуска = ТекущаяБазы.ПараметрыЗапуска.Получить();
	
	Возврат ПараметрыЗапуска;
	
КонецФункции

&НаСервере
Функция ЗаписатьПараметрыЗапуска(Параметры, ИнформационнаяБаза)
	
	БазаОбъект = ИнформационнаяБаза.ПолучитьОбъект();
	БазаОбъект.ПараметрыЗапуска = Новый ХранилищеЗначения(Параметры);
	БазаОбъект.Записать();
	
КонецФункции
