

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрукутараПараметров = Константы.ОбщиеПараметрыАутентификации.ПолучитьСтруктуруНастроекПоУмолчанию(); 
	Если ЗначениеЗаполнено(СтрукутараПараметров) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтрукутараПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыНаСервере()
	
	СтруктураПараметров = Константы.ОбщиеПараметрыАутентификации.ПолучитьОписаниеСтруктурыПараметров(); 
	
	Для Каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		
		СтруктураПараметров[ЭлементСтруктуры.Ключ] = ЭтаФорма[ЭлементСтруктуры.Ключ] 
		//ЭлементСтруктуры.Значение = ЭтаФорма[ЭлементСтруктуры.Ключ];
	КонецЦикла;
		
	Константы.ОбщиеПараметрыАутентификации.ЗаписатьСтруктуруНастроекПоУмолчанию(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ЗаписатьПараметрыНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
